{"format":"particle","title":"Athene.Gay","content":[{"type":"button","label":"Home","action":"https://athene.gay/projects/../index.json"},{"type":"paragraph","text":"This Website"},{"type":"paragraph","text":"2025"},{"type":"paragraph","text":"It\u0027s the website you\u0027re looking at right now, baby!!"},{"type":"paragraph","text":"I can\u0027t pretend this website is particularly complex. It\u0027s pure HTML and CSS. I don\u0027t even have any javascript in it apart from the embedded hit counter at the bottom. Maybe I\u0027ll use some in future if it\u0027s necessary but I\u0027m writing each entry directly in the HTML instead of pulling from a database or such, so outside of doing some fancy shit I don\u0027t see why I\u0027d ever need to. Here, here\u0027s a live screenshot of the site in VSCode so you can see I\u0027m really doing this the \u0027old-fashioned\u0027 way:"},{"type":"paragraph","text":"The web is too damn complicated nowadays. I don\u0027t think this is a particularly controversial statement. Everyone seems to want to make everything into a single-page application, host with node or some .net backing with a big MVC structure behind it, have myriad front-end technologies to make everything oh-so-slick. And sure, there\u0027s a place for that. I work for a company whose main product is an Angular SPA with a big .net backend that is hugely multifunctional."},{"type":"paragraph","text":"But personal websites do not need that, really. I kind of fundamentally disagree with it. A portfolio website can impress with your talent for design, for sure, but when you\u0027re working on something like this, where it\u0027s just for you - is any of it really necessary?"},{"type":"paragraph","text":"All that overhead certainly makes it slower. The web is so damn slow now. I got gigabit internet recently, which has certainly been revelatory for streaming and steam game downloads, but actual day-to-day web use is basically unimpacted. I can download sites faster, theoretically, but the framework is doing so much internally that it makes practically no difference."},{"type":"paragraph","text":"And for a small site of my own, I simply do not want that. I want something that feels fast and responsive. And what\u0027s faster than a static website?"},{"type":"paragraph","text":"So this is what that is, in a very classic style. Pure HTML and CSS. Iframes for stuff like the links and footer bars. Manual linking and organisation. A marquee tag for the header, gotta respect the classics."},{"type":"paragraph","text":"I even have a links panel, which I hope to fill out with links to friends\u0027 and acquaintances little homes on the internet. Webrings were fuckin\u0027 cool and we\u0027ve lost them, so let\u0027s bring them back. If you want to be included, shout me on bluesky."}]}