{"format":"particle","title":"Cootie\u0027s X-Ray Vision - ROMP","content":[{"type":"button","label":"Home","action":"https://athene.gay/diversions/hentaigames/../../index.json"},{"type":"paragraph","text":"Cootie\u0027s X-Ray Vision - ROMP"},{"type":"paragraph","text":"In or before 2001"},{"type":"paragraph","text":"The world was a simpler place pre-9/11. All one needed to enjoy one\u0027s self was a flash to pose the question: what if you had x-ray specs? Wouldn\u0027t it be great to see a titty without having to take any clothes off?"},{"type":"paragraph","text":"There\u0027s not much to this \u0027game,\u0027 if you can even call it that. You take the glasses from the extremely racist traveller stereotype and use your cursor to reveal BOOBIES and WILLIES and MINGE. Then you reach the end of the 4 or so screens, float your cursor over the traveller\u0027s own scrote, and get stabbed. Game over."},{"type":"paragraph","text":"The masking is pretty clever. Not sure if early flash was capable of simple mask blending or if this is some clever hack the developer put together. Probably the former, really."},{"type":"paragraph","text":"2001 isn\u0027t all sunshine and roses, though. The racism is aforementioned. There\u0027s also some textbook fatphobia (because who would ever want to look at a fat person naked, am I right lads????) and of course, the requisite trans stereotype (oh my god, a woman, but she\u0027s bald under the wig and has a dick! Scandal! She has my number). It\u0027s hard to get mad at - this was probably made by a 13 year old boy trying to be edgy - but it is a useful time capsule of how far we\u0027ve come in general acceptance of marginalised groups? The nearest neighbour for flash hentai now is artists posting their 18\u002B drawings on bluesky and in those circles you\u0027re likely to find some absolutely scrumptious portrayals of trans people, fat people, people of colour, et al. Porn is no longer a scene for boys and boys alone, and the world is better for it."}]}