{"format":"particle","title":"\n      The First Annual \u0027What Athene Played and Watched This Year\u0027 List: FILMS\n    ","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"The First Annual \u0027What Athene Played and Watched This Year\u0027 List: FILMS"},{"type":"paragraph","text":"22/12/2025"},{"type":"paragraph","text":"Like many trannies, I keep a media list on my bluesky every year. Here\u0027s a bit more details on my favourite things from this year."},{"type":"paragraph","text":"First up though, the complete list, sorted by type. This is a list of things that were new to me this year, so it\u0027s a mix of stuff from 2025 and the past. Everything on there is something I finished (or, in the case of video games, played long enough to feel like I\u0027d got everything I wanted to out of it) - there\u0027s a number of half-finished series on my Jellyfin server that I ran out of steam on. Not everything on the list is good, but it was at least enjoyable enough to get to the end of, so please treat the entire list as some kind of endorsement."},{"type":"paragraph","text":"TV Series"},{"type":"paragraph","text":"Film"},{"type":"paragraph","text":"Video Games"},{"type":"paragraph","text":"OK COOL. Big list. Donezo. Now it\u0027s time for TOP FIVES. First up: movies. TV and games will come later this week."},{"type":"paragraph","text":"FILM"},{"type":"paragraph","text":"5. The Descent"},{"type":"paragraph","text":"Horror movie with all woman cast from early 2000s: recipe for disaster, you\u0027d think. But The Descent defies expectations in many many ways.It\u0027s excellent! I was lucky enough to see this in the cinema for a 20th anniversary screening. I feel like a lot of horror movies benefit the most from being seen in theatre, scares and spooks hit better on the big screen."},{"type":"paragraph","text":"And that is definitely true here! I was properly terrified throughout! The deep marks in my wife\u0027s hand can speak to that."},{"type":"paragraph","text":"It\u0027s interesting that this film was not specifically written to be all-women. I guess that makes sense - most of the characters have actual... personalities? Which for women in film of that era is super-unusual. In amongst the gore and scares there\u0027s messy, bitchy drama. There\u0027s a Chekhov\u0027s Necklace. There\u0027s themes of maternal otherness!!"},{"type":"paragraph","text":"Which is to say, film\u0027s got a lot going on, and I was delighted to be surprised by how good it was."},{"type":"paragraph","text":"4. Weapons"},{"type":"paragraph","text":"This year\u0027s Hottest Take Generator! Is it about school shootings? Is it about noncing? Should we call Yewtree?"},{"type":"paragraph","text":"I don\u0027t know, honestly. But I don\u0027t think it really matters. Divorced from any Words about what it\u0027s About, it\u0027s fundamentally just an extremely well put-together thriller."},{"type":"paragraph","text":"I think the multiple-viewpoint structure works really well for it. It pulls the rug out from the viewer just as they\u0027re getting comfortable with each protagonist."},{"type":"paragraph","text":"I think it\u0027s fair to say a lot of horror films flub the final act. Weapons almost does, but by shifting into slapstick in that last ten minutes it swerves and kinda works? It\u0027s solid catharsis considering the tension the entire film has built up, and the slapstick itself is funny enough that the tone flies well. Great flick."},{"type":"paragraph","text":"3. 28 Years Later"},{"type":"paragraph","text":"I described this movie on Bluesky as full of both Boyle\u0027s and Garland\u0027s worst excesses, and I stand by that. Yet despite that, the movie absolutely soars."},{"type":"paragraph","text":"28 Days Later was lightly allegorical for Britain\u0027s societal decay, Years pushes that to the fore far more than I expected. A stagnant little island, closing its borders and disallowing outside entry, for fear of those raping, pillaging monsters to discover this green and pleasant land. But enough about Brexit!"},{"type":"paragraph","text":"I\u0027m being facetious. But it\u0027s impossible not to draw these parallels, they\u0027re absolutely plain on the face of the movie. This is a film about Brexit, about the hideous racism that continues to erupt through Britain\u0027s skin. Boyle uses colonial propaganda to decorate the safe haven, he uses scalps and skulls claimed by teenagers - and teenage boys in specific, women relegated to servitude in this society - to demonstrate their entry to adulthood. To manhood."},{"type":"paragraph","text":"I find Erik\u0027s inclusion in the story fascinating. A direct demonstration of Europe plodding on just fine without Britain, our entire island left to rot in its own filth. Spike is fascinated by Erik\u0027s iPhone - a physical manifestation of the world carrying on with one less country on its map. History ended for Britain, but the rest of the world continued on."},{"type":"paragraph","text":"The Jimmy Saville thing was heavily commented on by incredulous cinemagoers just after its release, as if it was just shock value. But I feel it is the perfect thematic endpoint of the film - Spike is something new, someone interested in shaping the rubble of the old world into something resembling society. But society has moved on. We, the audience, know Jimmy Saville was a pedophile. But the model of Britain maintained by the film is fighting to remain. A hideous, noncing isolationist monster."},{"type":"paragraph","text":"Fuckin\u0027 phenomenal movie. Can\u0027t wait for the next one."},{"type":"paragraph","text":"2. Summer Wars"},{"type":"paragraph","text":"Hey, you heard of this movie called \u0027Summer Wars?\u0027 Pretty fuckin\u0027 good I reckon! Pretty seminal!"},{"type":"paragraph","text":"Being facetious, here, obviously. Recommending people watch \u0027Summer Wars\u0027 is only really one notch away from saying \u0027you should watch Akira\u0027, it\u0027s not exactly a hidden gem. But it is excellent."},{"type":"paragraph","text":"I watched it twice this year, once at home, once at the cinema. It is so interesting to me how similar it is to the Digimon short \u0027Our War Game\u0027 (same creative team), just expanded to feature length. And rightly so, honestly, that one short is bursting with ideas that it feels like couldn\u0027t quite be executed to the degree they deserved within that envelope. It\u0027s nice when a creator gets a second crack at an idea."},{"type":"paragraph","text":"Hosoda\u0027s got an adaptation of Hamlet coming out next year, which I cannot wait for. And also leads me neatly on to..."},{"type":"paragraph","text":"1. Grand Theft Hamlet"},{"type":"paragraph","text":"Hey. Hey, you. Remember the COVID19 pandemic?"},{"type":"paragraph","text":"Yes yes I know it\u0027s still going on etc etc but you are picking up what I\u0027m putting down. The lockdowns and the accompanying isolation. Retreating into virtual worlds. The nuclear impact of Among Us and Animal Crossing: New Horizons."},{"type":"paragraph","text":"What would a film about that actually look like, though?"},{"type":"paragraph","text":"Hey. Hey you. Remember Grand Theft Auto V?"},{"type":"paragraph","text":"It\u0027s weird to think about GTAV as a game that is still extant. That game came out when I was 20! I was still at university! I was literally a boy at that point!"},{"type":"paragraph","text":"But it still exists. I\u0027ve played quite a lot of it in the intervening 12 years, too, especially of GTA Online, a wholly different beast than the story mode that tentpoles the game."},{"type":"paragraph","text":"There\u0027s a whole subculture in GTA Online of roleplay servers, and unique gamemodes... grown men reliving GModRP from the 00s but on a much, much grander budget. It\u0027s even something Rockstar themselves support."},{"type":"paragraph","text":"Some roleplay they don\u0027t officially support, though? Acting. So what if you put on a performance of Shakespeare\u0027s Hamlet, right there in GTA Online. In a live server."},{"type":"paragraph","text":"That\u0027s the hook of Grand Theft Hamlet. But it\u0027s not really what the film is about."},{"type":"paragraph","text":"It\u0027s a film about isolation and loneliness. About the slow fractures that build in relationships. About depression and suicidal ideation. And, of course, about how you even go about staging a play in a game about blowing each other up."},{"type":"paragraph","text":"It\u0027s a really beautiful film that manages to capture 2020 in amber in a way I didn\u0027t really think was possible. I recommend everyone watch it. It was my high watermark for movies this year and nothing compared, in the end. A fantastic way to spend an hour and a half."}]}