{"format":"particle","title":"Breathing Life Back To Paradise","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"Breathing Life Back To Paradise"},{"type":"paragraph","text":"25/07/2025"},{"type":"paragraph","text":"This post has minor spoilers for Death Stranding 2."},{"type":"paragraph","text":"The screenshot above looks pretty generic. Death Stranding 2 is a very beautiful game and its vistas are what make it. But not all of them are particularly breathtaking, and I\u0027ll happily admit the above image is one of them."},{"type":"paragraph","text":"To me, though, it\u0027s very special. Because the spot in this image is the very last road I needed to build to complete the entire Australian highway. It\u0027s probably the greatest achievement I\u0027ve ever accomplished in a game. And it\u0027s completely unremarked upon."},{"type":"paragraph","text":"Completing the road network doesn\u0027t earn you a new tool, or a playstation trophy. Hell, unlike opening all the monorails, it doesn\u0027t even warrant a Social Strand Service post. I didn\u0027t know this, before I set out on the endeavour to complete the network. But it didn\u0027t matter if there was a reward - it was the right thing to do."},{"type":"paragraph","text":"Death Stranding 2 is a game all about the right thing to do. It applies on the macro level, of course; pummelling Higgs is the right thing to do. But every order you take, every action in the world, every ladder and anchor you place, is the right thing to do."},{"type":"paragraph","text":"Kojima called Death Stranding the first game in a new genre, the \u0027strand-type\u0027 game and while that might be grandiose, I don\u0027t think he\u0027s strictly wrong. No other genre is as focused on encouraging collaboration both inside and outside the fourth wall, and it is undeniably successful. The whole game is a joy of discovering a bit of cargo is positioned awkwardly on a high ledge, then spotting a ladder from xXCriminalNukeXx right next to it. Of course you\u0027re gonna hit the like button."},{"type":"paragraph","text":"And the roads are the zenith of that idea. Restoring a road between two destinations is a huge, expensive, multi-step effort. It requires everyone involved to be completely invested in the game, to be making side-quest deliveries to get access to more resources, to expand the network. But the reward it offers is unlike anything else - that challenging, rough terrain that you\u0027ve battled over to get to the paver is instantly nullified by a flat, powered road."},{"type":"paragraph","text":"Finishing a road connection is instantly rewarding, yes, but the game makes concerted efforts to reward it long-term, too. You\u0027ll fairly regularly be asked to retrace your steps, to make a delivery to a prior bunker. Without roads this is challenging - albeit less challenging than the first time through since the network will have other player\u0027s structures populated in - but with a road, it feels like you\u0027re being congratulated. \u0022You have made this world better for everyone who inhabits it. Take a victory lap.\u0022"},{"type":"paragraph","text":"I attached to the roads in the first game, and was rewarded for it in a similar fashion - at the climax of DS, the chiral network goes down, trashing all the structures you and others have built. It\u0027s supposed to be one final test of what you\u0027ve learned. But if you built the roads, they remain and the journey back to the start is trivial, that victory lap."},{"type":"paragraph","text":"So I did the same in the second game, and it returned the favour multiple times. But none of these events are a traditional reward - it\u0027s purely generated from your own knowledge of how much it would have sucked to backtrack without it. It encourages you to do the right thing."},{"type":"paragraph","text":"So I built out all the roads, continuing after the game ended, when there was no chance of any backtracking missions. Because building this infrastructure, for the people you meet, the porters you have played alongside, and those who will come after you, is the right thing to do."},{"type":"paragraph","text":"You\u0027re probably thinking that\u0027s a bit pretentious. It\u0027s just a video game, after all, and most of the characters in Death Stranding are just holograms. But all of that artifice somehow falls away, because you\u0027re making this world better, and doesn\u0027t that feel good? Doesn\u0027t doing the right thing feel good?"},{"type":"paragraph","text":"Of course it does. That\u0027s kind of the basis of most leftist thinking, after all. The right thing to do may not be the most optimal choice for you, personally - certainly building every road was not optimal, the optimal choice would be building roads just over the most tricky areas - but it feels good to do it! It feels good to help others out!"},{"type":"paragraph","text":"There\u0027s only two strand-type games in existence, but another 2025 game actually comes... strangely close. It\u0027s a purely single-player experience and it\u0027s called Promise Mascot Agency, from the developers of Paradise Killer."},{"type":"paragraph","text":"The high-level concept is batshit. You\u0027re a disgraced yakuza (voiced by the same VA who portrays Kiryu!) who must transform a mismanaged love hotel into a successful \u0027mascot agency,\u0027 that rent out giant mascots to events. Except the mascots are sentient, not costumes. And also it\u0027s secretly a game about leaving a run-down, corrupt and forgotten town much better than you found it."},{"type":"paragraph","text":"Every side quest is about restoring the town in some way. Whether it\u0027s cleaning up shrines, smashing through trash bags, or laying vengeful spirits to rest, everything you do makes this town better. It\u0027s full of characters who you come to know and understand as you do jobs for them. They lead full lives in this little town, and want it to get better. And it rubs off! You, the player, want to make this town better! You make these connections, offering out the rope to help others climb. It\u0027s magical."},{"type":"paragraph","text":"Kaizen Gameworks\u0027 previous title was the venerable PARADISE KILLER, a murder mystery that you actually have to solve. The case you\u0027re solving is the murder of the leaders of a cult, and you\u0027re also a member of that cult. Which you\u0027d think wouldn\u0027t give much room for maneuveur on making that world better, especially since to craft Paradise, the island it takes place on, thousands of human proles must be sacrificed."},{"type":"paragraph","text":"But even within that restrictive frame, you can make the world a tiny bit better. Fix up vending machines. Venerate wrongly accused subjects. Repair a marriage. Make out with a goat woman. Admittedly, that last one is just good for me."},{"type":"paragraph","text":"And I think that speaks to how Kaizen just get it. The world we live in is dark, darker by the day, but we as people need to fight to make it better, in even the smallest of ways. And Promise Mascot Agency and Paradise Killer understand that."},{"type":"paragraph","text":"As Death Stranding 2 goes on, you meet Tomorrow, a Mysterious Kojima Woman who has the power to accelerate aging of things she touches. When you first meet her, Fragile hands her an apple, and it rots and crumbles in her hand. As you journey across Australia she is taught many things about the world by Rainy, another of your allies - another Mysterious Kojima Woman who, whenever she steps outside, summons timefall rain, which does much the same thing as Tomorrow\u0027s aging touch."},{"type":"paragraph","text":"Every so often, when you re-enter your base, Tomorrow will be there, with an apple. Each time, it\u0027s less aged. She\u0027s learning to ripen them. By the end of the game, she can ripen them perfectly, giving Sam a little snack. As you play you discover that Rainy\u0027s ability has a wonderful side-effect - wherever she emerges, wherever the DHV Magellan surfaces from the tar, her rain falls, and new plants grow."},{"type":"paragraph","text":"The crew are breathing life back into paradise, and we can do it too. With small actions, we can make the world better. So let\u0027s do it."}]}