{"format":"particle","title":"For Those Who\u0027ve Gone Beyond","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"For Those Who\u0027ve Gone Beyond"},{"type":"paragraph","text":"15/10/2025"},{"type":"paragraph","text":"Huddled under a railway arch in Vauxhall, there\u0027s a wormhole to the 22nd century. It\u0027s like nothing else."},{"type":"paragraph","text":"Earlier this year, shortly after surgery and during MCM May, Cat and I visited Bridge Command for the first time. It\u0027s an experience that\u0027s hard to really describe - part video game, part LARP, part interactive theatre, part escape room, it offers an experience like nothing I\u0027ve seen before."},{"type":"paragraph","text":"You may have seen the People Make Games video on Bridge Command already. It\u0027s a great video and offers a pretty complete idea of what an average Bridge Command \u0027performance\u0027 entails, which is some kind of mix of chaos, drama and lore. If you do well, you get promotions or commendations, if you do badly... well, you don\u0027t. But whatever happens you get a pretty unique experience!"},{"type":"paragraph","text":"Obviously, there\u0027s a bit of a thumb on the scale - the cast and ops know that players are going to have a better time if they\u0027re successful after facing an appropriate challenge, so missions are adjusted dynamically to give players the best experience. It is possible to fail missions, so I\u0027m told, but I\u0027ve yet to experience it myself. What does seem to happen more often is a \u0027partial success,\u0027 especially in mission types that aren\u0027t pure combat. You might succeed in delivering your cargo, but didn\u0027t solve the puzzle the actor handed you early on, so you didn\u0027t get a full resolution to the story. Or maybe you negotiated with pirates, but blew up one of their friends on the way to the summit, so the terms didn\u0027t end up in your favour."},{"type":"paragraph","text":"These RPG inspired quasi-successes work really well as hooks to bring you back! Something Cat, Aris and I encountered in one of our missions was so surprising and expanded the world so far beyond what had previously been established and it only made the claws dig in deeper."},{"type":"paragraph","text":"The actors help sell this, of course. Each actor plays a named person within the UCS, which is their \u0027canon\u0027 character, whose achievements, rank and role change regularly. There are engineers, ace pilots, captains and commanders and plenty more, and you\u0027ll usually interact with two on your mission - one who trains your group on how to operate the ship, and one who acts as your flight commander, giving you mission updates from the Warspite. Then while on mission, you\u0027ll often run into further characters, all played by these same actors (else the cast would be enormous). It\u0027s clearly a job that requires a lot of its cast, with them having to change role multiple times a day and put in convincing performances for each, often requiring physical acting. On one mission we rescued a man who had been running out of oxygen on a space station. As they collapsed into the ship from the airlock, suddenly I wasn\u0027t looking at an actor, but someone who needed help, and I forgot where I was and helped them limp into the bridge. A really magical performance."},{"type":"paragraph","text":"But that\u0027s all just the normal missions, ones you can go to any day of the week (except Mondays). I\u0027m here to talk about the Special Event we attended last weekend."},{"type":"paragraph","text":"Bridge Command itself is made up of two different ships and a bar which, in-universe, is the Destroyer-class UCS Warspite that the two smaller ships (the UCS Havock and Takanami) despatch from. When you book on normally, you\u0027re put on one of the ships for an hour and a half or so and have some time in the bar before and after. But the special events are different. You\u0027re part of one huge crew, a full crew of both ships and a reserve pair of crews who alternate on to the ships every half hour or so."},{"type":"paragraph","text":"While on the ship, you\u0027re in what is mostly a regular mission, albeit longer and (usually) with higher stakes. While on the Warspite, you\u0027re in a LARP, talking to the characters and making plans that you and all the other teams will enact throughout the evening. These events are much longer than a normal session - around four hours - and have the space to tell a grander story."},{"type":"paragraph","text":"Some spoilers for Operation Daedalus follow. If you plan on attending a rerun of this event, please do not read further."},{"type":"paragraph","text":"The one we attended was a rerun of one from September, and there\u0027s talk of another run of it - so I won\u0027t spoil exactly what happened. However, there was a moment in our performance that has now become canon and shared with the wider community."},{"type":"paragraph","text":"Throughout the event, while we were on the Warspite, there was a lot of talk about Lieutenant Commander Furlong being missing. Furlong had been a mainstay of the Warspite - many people there had struck up friendships with the character and shared real moments with him. As the evening went on, more and more fear crept into the Warspite staff. Captain Hamilton, who was in direct command of Furlong, chased for information about him from anyone who they could grab. Lt. Kihu, after getting news her friend (or something more) who\u0027d been stationed on the UCS Khopesh, was safe, broke down in tears. But still, no word of Furlong."},{"type":"paragraph","text":"The evening hit its climax. A suicide mission, with someone holding the Dead Man\u0027s Switch. I was proud to be captaining the Havock as we reached that peak, as we did a Pacific Rim, with evacuees from the Warspite on my bridge. Our hull is totalled, we\u0027re outgunned, and everything is compeltely fried. The power cuts. And we\u0027re back, fully repaired, docked to the Warspite. Everyone crowds back to the Mess."},{"type":"paragraph","text":"The person on that Dead Man\u0027s Switch is still alive. People are confused, there\u0027s plenty of chaos. Then it all quietens as in from the ship bay stumbles Furlong. He gets carted off to the medbay. We deliver a report to the Captain. As it winds up... the news everyone\u0027s been dreading."},{"type":"paragraph","text":"Thrice the lethal dose of radiation. He\u0027s gone."},{"type":"paragraph","text":"There\u0027s a beat. The room is silent. And then one of the crew members starts to sing. A memorial song."},{"type":"paragraph","text":"I\u0027m not ashamed to say it brought me to tears. By the end, the whole crew was singing the chorus."},{"type":"paragraph","text":"Every time I\u0027ve been to Bridge Command, I\u0027ve come away jonesing for more. The special event was that, times ten. We\u0027re already booked in for the end of the month for some spooky halloween missions. I am sure both will cling to me as much as this event did. If you\u0027re in the UK, I highly recommend you make the trip to London to visit. It\u0027s like nothing else out there in the great wide cosmos."},{"type":"paragraph","text":"Here\u0027s to you, Furlong. For those who\u0027ve gone beyond."}]}