{"format":"particle","title":"It\u0027s 2025 and I am playing a D\u0026D Game...","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"It\u0027s 2025 and I am playing a D\u0026D Game..."},{"type":"paragraph","text":"01/02/2025"},{"type":"paragraph","text":"... and it\u0027s not Baldurs Gate 3; it is, however, equally 7/10."},{"type":"paragraph","text":"OK, now I\u0027ve got my hot take out the way, let\u0027s talk about a fun game from 2013 called Call of Juarez: Gunslinger that is very much not the game I have been playing. I promise I\u0027ll bring it round though."},{"type":"paragraph","text":"The Call of Juarez series isn\u0027t particularly interesting outside of this title. They\u0027re very average Western first-person shooters from the late noughties and early 2010s. I imagine, having not gone back to them, that they are also probably quite racist. One of them is about two brothers fighting in the civil war who desert as the \u0027war nears its end,\u0027 which sure sounds like they were on the losing side."},{"type":"paragraph","text":"Gunslinger, however, is different. It\u0027s actually a game about storytelling. You\u0027re Silas, a cowboy sat in a saloon telling his life story - the hook of the game being that Silas is an unreliable narrator. As Silas tells the story, and the people around him pick holes in his tale, the world you\u0027re playing in changes rapidly. The launch trailer shows how that works, skip to 1:12 for the relevant bit."},{"type":"paragraph","text":"And this is extremely cool, right? It feels futuristic, and honestly it feels like kind of how the future of video games should have been. But I don\u0027t think I ever saw this kinda thing again? We have \u0027dynamic\u0027 worlds in some sense in that a building will fall down, or a new route opens up somehow, but nothing on the scale of the world shifting around the player."},{"type":"paragraph","text":"And I do understand why. This, as with anything, is down to budget. if you have a scene that changes as the story changes, that\u0027s expensive. But it feels kind of revolutionary in a way that, frankly, I don\u0027t think video games have felt in a long, long time."},{"type":"paragraph","text":"So yeah, Call of Juarez: Gunslinger. Cool experiment, fun game, weird vision into a future that never was."},{"type":"paragraph","text":"Tiny Tina\u0027s Wonderlands is a 2022 Borderlands spin-off that is that imagined future."},{"type":"paragraph","text":"OK, preface, I know that one of the words in that sentence has probably immediately turned off quite a lot of people reading this. I am aware Borderlands is extremely marmite. I have played most of the games and I would struggle to call any of them \u0022great\u0022 - they\u0027re competent shooters, they nail the looter-shooter loop that so many games since have tried and failed to imitate (Destiny has and will always suck, don\u0027t start) and they are famously groan-worthy when it comes to writing and story."},{"type":"paragraph","text":"I played quite a few games in January and towards the end I was itching for a shooter, ideally one fit for the Steam Deck. I\u0027d tried Borderlands: The Pre-Sequel before and bounced off it, but I picked it up for another go on Valve\u0027s miracle machine and had a great time. I think that game is helped by it being developed by 2K Australia, a studio with Bioshock pedigree, so it\u0027s a really really solid shooter; but it\u0027s also honestly pretty funny when it gets to be properly Australian. it also leans heavily on Handsome Jack, the antagonist of Borderlands 2, and inarguably the series\u0027 highpoint when it comes to character writing. it still has its \u0027cringe\u0027 moments, but I think it\u0027s generally better written than 2 (and certainly 3) and also it has lasers. Which are fun."},{"type":"paragraph","text":"After finishing that, I remembered I\u0027d tried Tiny Tina\u0027s Wonderlands on deck sometime in 2023. it didn\u0027t run great, muddy visuals and a very janky framerate making it pretty painful to actually play. But hey, these things get patched, and after a reinstall and some fussing in the settings (specifically, turning FSR2 on and setting it to \u0027Balanced\u0027) I ended up with a game that both looked pretty reasonable and ran very well! It\u0027s 60fps most of the time, but does drop to mid-forties when the vistas are big or there\u0027s an excessive amount going on on-screen. But it\u0027s certainly playable."},{"type":"paragraph","text":"With those fixes in place, I rolled a new character and dove in. About an hour in, after the tutorial has concluded and you enter the main town to find it ransacked, the game\u0027s magic trick begins. Fighting your way to the centre square and freeing \u0027Butt Stallion,\u0027 the kingdom\u0027s ruler (yes, I know. Unfortunately this one is a Gearbox in-house production, with all that entails), Tiny Tina, the DM of the game, tells you about the city repairing itself in typical lyrical DM fashion."},{"type":"paragraph","text":"And then the city changes around you. Fires extinguish, bricks that had crashed to the ground float and repair into pristine buildings. Rainbows sprout around the castle. It\u0027s honestly pretty magnificent to watch."},{"type":"paragraph","text":"This isn\u0027t actually the first time the game has pulled this trick, but it;\u0027s the first time your focus isn\u0027t on the combat, so it\u0027s hard to ignore. Earlier, as youre fighting towards the town, Tina describes a siege happening around you, and in an adjacent field, siege engines, vast armies, ramparts and defences materialise, a battle suddenly taking place where before there was green grass and tranquil hills. She details a ship full of skeletons and it shores up next to you, a fresh barrage of foes to fight."},{"type":"paragraph","text":"It\u0027s hard to overstate how magic this feels, and it\u0027s spread all through the game. The grander changes to the world around you are kept for story beats, of course, but this game being a tale told at a D\u0026D table is weaved throughout in other ways. Borderlands isn\u0027t exactly a choice-heavy RPG, the main quest is laid before you already written, and side quests can only really go one way as well, with maybe a minor amount of variation. But in that outwardly restricting framework is how the spirit of TTRPGs thrives here. You can choose to seduce a character instead of fighting them in one side quest; a D\u0026D classic. Your other friends at the table talk amongst themselves, arguing rules or paths forward, making dice checks and complaining to the DM."},{"type":"paragraph","text":"And honestly, I think it\u0027s an interesting way of adapting a D\u0026D session to a video game! Baldurs Gate and its ilk are laser-focused on player choice in both the micro and macro, they implement the rules and functions of a tabletop rpg as if they\u0027re set in stone, the inarguable realities of these games. But isn\u0027t the real magic of TTRPGs in the unexpected? Humans are unpredictable; a video game is never able to expand the possibility space in a way a human DM can."},{"type":"paragraph","text":"So instead, Tiny Tina\u0027s Wonderlands doesn\u0027t try to. You\u0027re the player character, but the players themselves are the others at the table, improvising and adapting. The result is a game that feels closer to playing D\u0026D than any CRPG ever could, even if the choices are entirely out of your hands."},{"type":"paragraph","text":"It means that these wild storytelling swerves can be designed for. Baldurs Gate 3 couldn\u0027t have an entire ocean evaporate, entirely changing the world, because, well - what if the player chooses not to do it? By being strictly linear, the world feels strangely more real than Faerun ever did for me."},{"type":"paragraph","text":"That\u0027s not to say the spectre of budget constraints don\u0027t haunt the game, mind. Unlike every other Borderlands game, the world isn\u0027t contiguous, instead each \u0027adventuring area\u0027 is separated by an overworld, which is designed to resemble a DM\u0027s map, with miniatures dotting it. It acts kind of like a classic Final Fantasy overworld. There\u0027s also the audiologs/comms of the game, which appear on screen without even an ease-in fade - suddenly there\u0027s a character\u0027s unanimated face in the top-right of your screen as they speak."},{"type":"paragraph","text":"And I will admit it\u0027s distracting. It feels like the cuts taken to accommodate the wild creativity elsewhere can be pretty brutal and in many cases stick out like a sore thumb. But personally? I think it\u0027s worth it."},{"type":"paragraph","text":"You don\u0027t get to take swings this big without sacrificing some parts of the game that would usually have zero rough edges. But I\u0027d always rather a game be ambitious and occasionally cut you with their rawness than be designed-by-committee, smoothed over globs of nothing."},{"type":"paragraph","text":"Despite ultimately being just another Borderlands, I will be remembering beats in Wonderlands for far, far longer than anything 2 or 3 offered up. And that\u0027s something that really should be celebrated."}]}