{"format":"particle","title":"Fucking Your Friends For The Love Of The Game","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"Fucking Your Friends For The Love Of The Game"},{"type":"paragraph","text":"02/09/2025"},{"type":"paragraph","text":"Pope Francis, in 2024, once used the phrase \u0027air of faggotry,\u0027 which has since become the energy I wish to live my life fuelled by. Since then, I have only got gayer. And part of how I have only got gayer is by accidentally falling into becoming polyamorous."},{"type":"paragraph","text":"\u0022A polyamorous transfemmer? Groundbreaking,\u0022 I hear you say, and it\u0027s true. Trans women do loooooove to be poly. But the thing is, and bear with me here, I think it\u0027s because they might be on to something?"},{"type":"paragraph","text":"Cat and I first dabbled in polyamory the year prior, where we ended up accidentally flirting too hard and fell into sexting with our friend Ada. Anyone who knows me knows I\u0027ve always been a hideous flirt, but a bit too much drink and some THC in the club later and before you know it I\u0027m talking about how much I want them to strap me. Whoops!!!"},{"type":"paragraph","text":"Since then it\u0027s been kinda constant. We can\u0027t seem to make friends without also ending up fucking them in some fashion. And it\u0027s honestly been delightfully liberating?"},{"type":"paragraph","text":"There\u0027s still so much puritanism around sex. Christianity has had a hell of a long reach. I think it\u0027s fair to say sex is still widely considered to be divorced from friendship, that your friends and your pursuits are separate and mixing them is largely a Bad Idea."},{"type":"paragraph","text":"But, like, why? I know heterosexuality is a prison for many people but, seriously, why? Sex is intimate, sure, but it\u0027s also... fun? An entertaining way to spend an evening? A good way to kill an hour? Why does it have to be reserved to a special subset of people you usually haven\u0027t got to know beforehand?"},{"type":"paragraph","text":"It\u0027s weird to me. Hets are weird to me. Some of the best sex I\u0027ve had has been with people I\u0027ve been friends with for ages! Last year I flew across Europe to see and shag friends. We had a sick evening together and then we hung out and went to a museum the day after."},{"type":"paragraph","text":"I guess it\u0027s because people think it\u0027ll impact your friendship? But... I don\u0027t think that\u0027s really true? Not with well-adjusted adults, anyway. We\u0027re always chatting with the aforementioned pan-continental booty call and will be back to hang out with them sometime soon. We stopped sexting with Ada ages ago but talking with them is still a delight and hopefully one day we\u0027ll manage to hang out with them IRL, when US travel is a little less insane."},{"type":"paragraph","text":"IDK what I hope to achieve with this post. Maybe I just wanna brag? But I fuckin\u0027 love being poly, and I wanna yap about it a little. I think more people should try it out! Free yourself of the arbitrary restrictions the world puts on you. Obviously if you\u0027re in a relationship discuss it with your partner first though lmao that\u0027s just shitty otherwise. But yeah! It\u0027s just fun, man. Sex isn\u0027t some big important event just have a good time. Life\u0027s short and everyone you fuck will bring something new and fun to your experience."},{"type":"paragraph","text":"And if you\u0027re lucky, someone will say \u0027wow, there are great acoustics in here\u0027 into your cunt, making you burst into fits of laughter. It\u0027s moments like that that make life worth living, baby."},{"type":"paragraph","text":"Ah, now that was definitely why I wanted to make the post."}]}