{"format":"particle","title":"It\u0027s 2026 and I\u0027m a Vriska Kinnie Now","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"It\u0027s 2026 and I\u0027m a Vriska Kinnie Now"},{"type":"paragraph","text":"18/01/2026"},{"type":"paragraph","text":"OK first things first can we have a nice round of applause for the first anniversary of the blog! I\u0027m a changeable beast so it\u0027s actually quite impressive I have kept writing here. Probably because I do genuinely find it quite easy. It\u0027s nice to just write my thoughts somewhere at length. Here\u0027s to many more."},{"type":"paragraph","text":"OK SO IN 2025 I STARTED READING HOMESTUCK AND ON THE SEVENTEENTH I FINISHED HOMESTUCK AND NOW I\u0027M INSANE."},{"type":"paragraph","text":"You\u0027ve probably definitely heard of homestuck. The first project Toby Fox worked on. The root of the trolls. Very, very, very long webcomic."},{"type":"paragraph","text":"But did you know? It\u0027s actually really, extremely good."},{"type":"paragraph","text":"The thing about homestuck which I did not know going in (and I imagine is probably easy to miss!) is that calling it a webcomic is very much selling homestuck short."},{"type":"paragraph","text":"Homestuck is primarily a webcomic, for sure. The panels can be kinda shitty and dumb. Or they can be absolutely stunning works of art. I have multiple panels decorating my profile and header pictures, watchface, and phone wallpaper. Many of those panels are in fact animated gifs, with rudimentary but often beautiful animation. Many of those panels are also accompanied with extended dialogue from one or more characters, which are captivating. Occasionally, a page is titled [S] something, denoting that the page is in fact a flash animation. These flash animations can be simple 2s loops, simple games, or, sometimes, a multi-minute lovingly drawn animated sequence."},{"type":"paragraph","text":"Those flashes are also accompanied by music! Which is where the Toby Fox connection comes in, but let\u0027s not get it twisted, the number of artists who contributed to Homestuck is very vast."},{"type":"paragraph","text":"Homestuck is a mixed media project then, and in so being, decides to play in the space of its form like, to be honest, nothing I\u0027ve ever seen before."},{"type":"paragraph","text":"Acts 1 through 5 are fairly straightforward - they definitely have interesting elements (the game where John explores Lowas and Alterniabound standout,as does Dave: Ascend, the first of those multi-minute animations). The author, Andrew Hussie, interrupts a few times to give a plot summary. Then, towards the end of Act 5, the first of the big rug pulls really comes out, with the theming of the website changing and the reveal that Hussie\u0027s fourth-wall-breaking sections are actually canonically in universe. Action begins to happen in the header and footer images of the comic as well as the main panels. Then [S] Cascade happens."},{"type":"paragraph","text":"I cannot imagine what it must have been like watching Cascade at the time. In fact, just go and fucking watch it yourself. It\u0027s  here. Do you see what happened there, one minute and twelve seconds in? Where the dog thing casts \u0027Red Miles?\u0027"},{"type":"paragraph","text":"The animation expands beyond the bounds of the panel,growing to swallow the page. You can completely understand why this comic broke people\u0027s brains."},{"type":"paragraph","text":"After this, it never stops. You get a bit of minorly interactive fiction. At one point, the story takes place in two parallel panels that sit next to each other. The layout and theme of the pages will continue to change. [S] Game Over fucks with the entire page throughout its runtime, changing the theme of the page multiple times. Characters break out of the panel and fight in the negative space. It\u0027s insane."},{"type":"paragraph","text":"And that should be the sell to people who want to read it, sure. \u0027Look how impressive it is. Look at how its play with form will go on to influence Undertale and Deltarune, its unarguable spiritual successors.\u0027 But backing all of that, is some genuinely excellent character drama."},{"type":"paragraph","text":"Homestuck has an absurdly large cast, especially by its climax, but each is fun and interesting in their own way. Some break out and form an archetype that multiple characters in future things you witness will inherit. Some are sad sack dope idiots but you love them anyway. Some are John\u0027s hot mom. It is, again, no surprise that they imprinted themselves on the comic\u0027s huge fanbase."},{"type":"paragraph","text":"Which brings us to Vriska god damn Serket. The most important character in all of Homestuck."},{"type":"paragraph","text":"Vriska is one of the trolls who get introduced in act 5, and also you definitely already know from seeing a convention photo at least once in your life. She\u0027s kind of a colossal asshole. I love her more than anything."},{"type":"paragraph","text":"I have imprinted on Vriska Serket like a lost puppy. In 3 months I have dyed my hair, got it cut in her style, bought multiple outfits to match her, and even occasionally started using her typing quirk. I am, I suppose, a Vriska kinnie."},{"type":"paragraph","text":"This is, undeniably, embarassing. But it also makes me happy! I love what I look like at the minute! I love my new hair! I\u0027m wearing jeans for the first time in a decade and I feel damn sexy doing so! Yes, it\u0027s silly, but life\u0027s too short to worry about being cringe. So I\u0027m embracing it! Because why the fuck not!"},{"type":"paragraph","text":"I\u0027ve even started drawing. I\u0027m shit but I love vriska so much I want to keep drawing her and get better until I can make her proud. You can keep up with that particular endeavour on bluesky if you want."},{"type":"paragraph","text":"Point is, homestuck\u0027s great. It\u0027s something of a modern rosetta stone, too - since reading it, there have been so many things that I have looked at and gone \u0022that\u0027s from homestuck\u0022 or \u0022they worked on homestuck.\u0022 Undertale and Deltarune are absolutely bursting with references. The composer and director on Unbeatable? Homestuck musician. Jamie Paige? HOMESTUCK MUSICIAN. There are cathedrals everywhere, for those with the eyes to see."},{"type":"paragraph","text":"A lot of people will tell you that you shouldn\u0027t read homestuck. It\u0027s archaic in some ways - the early acts have some slurs and some insensitivity, which has naturally not aged well. But it\u0027s still unlike anything else out there, and has completely reconfigured my brain. I went into this reading pursuing fandom archeology, and I\u0027ve come out of it a permanently changed woman. What a ride."}]}