{"format":"particle","title":"Miku Expo","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"Miku Expo"},{"type":"paragraph","text":"26/01/2025"},{"type":"paragraph","text":"I\u0027ve been thinking again about Miku Expo recently."},{"type":"paragraph","text":"I still kind of can\u0027t believe it was real? Miku is this nebulous thing that\u0027s basically just an instrument, yet on one night in October last year, she was real and playing music in London. An experience that really hit me quite hard."},{"type":"paragraph","text":"I\u0027ve been to a lot of gigs in my life. A few of them have been like that - concerts that feel unreal, like they shouldn\u0027t really happen? It\u0027s a brag but I once won tickets to see Gorillaz\u0027 dress rehearse for their Glastonbury set in like, 2010, and that was genuinely insane."},{"type":"paragraph","text":"But obvs that was insane because it was so small, like. 30 people, maybe? Lou Reed was sat behind me asleep until he was needed, lol. But Miku was a big gig, in Wembley Arena, with hundreds if not thousands of people there. Yet it still felt really revelatory?"},{"type":"paragraph","text":"It was just kinda surreal. The opening song of the set was Anamanaguchi\u0027s Miku, a favourite of tiktokers. I\u0027m a longtime guchi fan, pre-Endless Fantasy, and I\u0027ve seen them all three times they\u0027ve done a UK tour. And all three times they\u0027ve played tiny little venues; the Bodega in Nottingham holds maybe 200 people max?"},{"type":"paragraph","text":"And to see that track performed by Miku at a venue orders of magnitude bigger than anything Anamanaguchi have played here was, frankly, utterly surreal. I loved it! I mean, I loved the whole set, it was amazing to see artists like Kira, synthion and SAWTOWNE get represented alongside the classic big hitter vocaloid producers."},{"type":"paragraph","text":"We went in cosplay, too! First gig I\u0027ve been to in cosplay, probably reasonably, but again a lovely choice because so did so many other people! I think this was helped by MCM being the same weekend so plenty of people came straight from the con in cosplay."},{"type":"paragraph","text":"I was Magical Mirai 2023 Miku! Just cause the wig is bananaramas big. It was a good choice honestly, super comfortable streetwear, and while the wig was unwieldy it was honestly really fun to dance around in. I mean it ended up fucked, obviously, sweat \u002B dancing \u002B close proximity to a million other people tends to fuck up a wig something fierce. Cat was The Vampire Miku too and so got insanely excited when that was second on the set list, lol."},{"type":"paragraph","text":"But, yeah. Just a kinda insane experience that I really loved. I am so excited for the next time Miku comes to the UK!! Next time I\u0027m getting tickets Avery and Asa."}]}