{"format":"particle","title":"Fallout New Vegas, 15 Years On","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"Fallout New Vegas, 15 Years On"},{"type":"paragraph","text":"11/03/2025"},{"type":"paragraph","text":"Let it never be said I can\u0027t admit where I was wrong."},{"type":"paragraph","text":"Earlier this year I played Obsidian\u0027s Pentiment, which I adored. Fabulous little game with choices that really mattered and a genuine reverence and love for history."},{"type":"paragraph","text":"I\u0027ve tangled with Obsidian\u0027s games a few times to varying degress of success. Their South Park games are a good laugh, the Outer Worlds is weird and awkward and well, New Vegas."},{"type":"paragraph","text":"I\u0027ve played an awful lot of Fallout 3 and 4. Bethesda\u0027s games have a certain je ne sais quois that really makes them a delight, despite not being particularly good in... well, any respect. Fallout, especially, has a real magic in it; between the fantastic tech assets (the Pip-Boy, of course, but all the vault mechanisms, the terminals... they all feel so suited to the setting), the sublime score and radio that set the mood and some very moody storytelling in each location, it\u0027s easy to get lost in it."},{"type":"paragraph","text":"Despite that, mind, I\u0027d never managed to get into New Vegas, although not for lack of trying. Every year or so, I\u0027d go \u0027maybe this time it\u0027ll take\u0027 and then, without fail, I\u0027d bail around Primm. There was a fair amount of stuff that didn\u0027t gel with me in it, most notably the fact that early doors it\u0027s a damn hard game if you don\u0027t have Guns as a tag skill. I knew, of course, that a lot of the quests can be solved non-violently, so I\u0027d usually put all three tag skills in non-violent skills too."},{"type":"paragraph","text":"Not this time, though. This time I finished a playthrough, and smashed through the DLC, too. I tagged Guns, Science and Speech, which was a massive help. A massive help, really - tagging GUns makes the early game less brutal, and I still had plenty of points in skill check stats for early-game speech challenges."},{"type":"paragraph","text":"Which, honestly, made the game an awful lot more fun. Suddenly I wasn\u0027t doing chip damage on every single enemy and counting down the bullets till I was punching them. It made that initial journey to Primm and beyond a lot less gruelling."},{"type":"paragraph","text":"Anyway, turns out everyone who wasn\u0027t me was extremely right about this game. It\u0027s delightful. The shooting is still the same as in Fallout 3, which is to say, it\u0027s kind of rubbish, but everything around it rules. Being able to level Speech to 100 and talk down everyone in the game, even the Legion\u0027s Turbo Nazi? THRILLING. Meeting a guy at a solar farm and using your high science skill to correctly deduce he has no idea what he\u0027s doing? Phenomenal."},{"type":"paragraph","text":"The sheer possibility landscape in the game kind of beggars belief, to the extent that you kind of wonder how they even fit it all in. And especially how they managed to put it all together in just 18 months. How are there three different major factions you can side with on the strip, each with full-featured and intertwined storylines? How is there an ADDITIONAL \u0027no thanks\u0027 questline that lets you take Vegas independent? How come every place you go to in the Mojave has at least two or three quests attached to it, even if it\u0027s a single-purpose location like a Vault?"},{"type":"paragraph","text":"It\u0027s the kind of elegant design you simply don\u0027t see, really. Bethesda certainly don\u0027t do it. Baldurs Gate 3 kind of came close, at least in terms of density of quests, although it definitely doesn\u0027t have the same quality in its choices. Even Obsidian don\u0027t seem to have matched it, although granted I\u0027ve not played Avowed much or ever touched Pillars of Eternity. Maybe they\u0027ve cracked that nut again in those."},{"type":"paragraph","text":"Anyway, yeah. Good game! The DLC is pretty mediocre, although I really loved Old World Blues. That one specifically is buoyed by the Think Tank being so weird and fun and tragic? Maybe that\u0027s just me having \u0027old world blues,\u0027 myself, though - I do think the best writing in all of the Fallout games is when it\u0027s confronting the pre-war world and contrasting it with the current wasteland."},{"type":"paragraph","text":"But yeah. All this to say: if you were waiting for a sign to finally play New Vegas, this is it. It\u0027s ruddy bloody brilliant."}]}