{"format":"particle","title":"Welcome To Oz","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"Welcome To Oz"},{"type":"paragraph","text":"07/08/2025"},{"type":"paragraph","text":"This is the second in a series of posts about Mamoru Hosoda\u0027s films. The previous entry can be found here. The next one will be available in a few weeks."},{"type":"button","label":"here.","action":"https://athene.gay/entries/thegirlwholeaptthroughtime.json"},{"type":"paragraph","text":"It\u0027s 2009. The iPhone is brand new. The Wii and the DS are juggernauts, sitting in nearly every home in Japan. The internet is no longer the reserve of weird nerds and teenagers: it has well and truly arrived. Your boss posts on facebook. Brands have signed up to twitter."},{"type":"paragraph","text":"But even as the world becomes ever more digital, the world keeps turning, and summer arrives just as it always has."},{"type":"paragraph","text":"The Girl Who Leapt Through Time may have leant on nostalgia, but it was also a remarkably forward thinking film. It asks the viewer to savour the time they\u0027re given, to look to the future with bright eyes. Summer Wars, meanwhile, is a remarkably futurist film, imaging a world where everything, from train timetables to microwaves to provincial government, is controlled through one central, worldwide application. And yet, despite all that Summer Wars is a film about history."},{"type":"paragraph","text":"I\u0027m being a little bit facetious here - the A-plot in Summer Wars is undeniably a sci-fi bananza, but it is also a straight remake of Hosoda\u0027s earlier work on Digimon: Our War Game. You may know it as the middle third of Digimon: The Movie."},{"type":"paragraph","text":"And look, fair cop to Hosoda - he fuckin\u0027 nailed it with that short. It survived basically uncut into the movie (which cannot be said of the other two shorts that make it up) and then gets remade with the serial numbers filed off in Summer Wars, and it still absolutely rips."},{"type":"paragraph","text":"But the magic of Summer Wars is how it weaves the story of the Jinnouchi clan through each beat of the a-plot. Wabisuke and Sakae are the most important members to the plot, being the creator of Love Machine and the matriarch of the family, respectively, but each member has a chance to shine in their own way."}]}