{"format":"particle","title":"\n      The Girl Who Leapt Through Time (Theatrical Cut) (2025) (Sub) x265.mkv\n    ","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"The Girl Who Leapt Through Time (Theatrical Cut) (2025) (Sub) x265.mkv"},{"type":"paragraph","text":"09/07/2025"},{"type":"paragraph","text":"Time waits for noone."},{"type":"paragraph","text":"It\u0027s a common refrain through Mamoru Hosoda\u0027s first original film. (OK, it\u0027s not strictly original, being based on a novel, but this helps distinguish it from the one piece film and digimon short films he made beforehand). It\u0027s a phrase a lot of the characters seem confused by. It\u0027s unclear if this is because it\u0027s in English, or if it\u0027s because they\u0027re teenagers and aren\u0027t really comfortable with the passage of time yet. That\u0027s kind of the point, of course."},{"type":"paragraph","text":"As The Girl Who Leapt Through Time ages, though, it has taken on something of a different meaning. The film came out in 2006, when I was but 12 years old. The characters use gorgeous keitai phones. Makoto, Chiaka and Kousuke play baseball in the summer heat. Yuri and Koho harbour secret crushes in the schoolyard. Crickets chirp in the evenings."},{"type":"paragraph","text":"It\u0027s nostalgic."},{"type":"paragraph","text":"The Girl Who Leapt Through Time is the first anime I ever watched that wasn\u0027t Pokemon, Digimon or Beyblade. I was 15, going through a puberty I didn\u0027t want, in a brand new relationship with a girl I liked a lot. We sat in her living room and she showed me this film, this gorgeous, pale-hued dream of a summer half the world away, the winter\u0027s bite chased away by that haze on the screen. I fell in love immediately."},{"type":"paragraph","text":"A lot of Hosoda\u0027s magic is taking a high-concept premise, but then using it to find the magic in the mundane. Makoto is a time traveller, but she\u0027s a daft one, using her leaps to eat a pudding, to catch pitches, to avoid an awkward confession. She\u0027s an everygirl, unburdened with responsibility, her whole life ahead of her to try over and over again. She\u0027s everything I wished I could be, then. I didn\u0027t know why I identified so much with her. I guess I do now."},{"type":"paragraph","text":"We broke up soon after. I still don\u0027t really know why - I was probably too immature, or maybe she knew there was something wrong with me that I wouldn\u0027t work out myself for another half decade. But the film stuck with me, and every rewatch takes me back to that winter evening. Our first kiss had only been a few days prior - my very first - and I still wasn\u0027t sure how to handle being a \u0027boyfriend.\u0027 I mean, I still don\u0027t, that\u0027s why nowadays I\u0027m a girlfriend. But Makoto\u0027s love resonated through me like a tuning fork, that pure love that for a long time you think can only happen on screen and in books. She promises to come running for Chiaki, to find him through time himself. I wondered what it felt like to know you\u0027d chase someone to the ends of the Earth like that."},{"type":"paragraph","text":"I\u0027m lucky enough to know that love, now."},{"type":"paragraph","text":"I always come out of a Hosoda film with a renewed appreciation of the beauty of the world. They\u0027re beautiful stories, but they\u0027re also films that obsess over both natural and man-made majesty. The flowers and the bees. A tower of clouds. The diffused sunlight through a classroom window. A level crossing. It makes the world you live in feel so much more bright."},{"type":"paragraph","text":"There\u0027s a line, from The End of Evangelion, one that never fails to make me cry. It\u0027s the same sentiment as this, this reverence for the world around us, that we should take time, every day, to truly see that beauty. \u0022As long as there is the Sun, the Moon, and the Earth... it\u0027ll all work out.\u0022"},{"type":"paragraph","text":"Our world gets harder and harder to live in, every day. I spend so much of my time worrying, whether it\u0027s over people I love in America, terrorised by a regime that grows more terrifying by the hour, or whether it\u0027s at home, living as I am on TERF island. But works like this, art about normal people just doing their best... It reminds me we can all do that, too."},{"type":"paragraph","text":"I feel honoured to have seen this film in the cinema. I often feel like that, seeing films that I didn\u0027t or couldn\u0027t see in theatres the first time around. I think the cinema is kind of a sacred place, I guess. It makes a movie whole, complete."},{"type":"paragraph","text":"Time waits for noone. So we should make the most of it while we still can. To everyone out there who might need it - and everyone who doesn\u0027t, too. I love you. It\u0027ll all work out."}]}