{"format":"particle","title":"The Return of the KFC Double Down","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"The Return of the KFC Double Down"},{"type":"paragraph","text":"12/02/2025"},{"type":"paragraph","text":"OK this is a silly post but my friends asked me for a full review of the new kfc zinger double down. So here it is."},{"type":"paragraph","text":"The double down is The Goblin Meal To End All Goblin meals. Two chicken fillets as the buns in a burger, with something (previously bacon, now a hash brown) in the middle. It sounds horrible and honestly it kind of is, but that good kind of horrible that you only get with a really grotty fast food meal."},{"type":"paragraph","text":"It\u0027s awful. I love it. Haven\u0027t had one since they were last about in idk, 2019?"},{"type":"paragraph","text":"Anyway they\u0027ve made a new one and today I ate it. Was it good? Let\u0027s find out!"},{"type":"paragraph","text":"OK I have just finished eating it. It is Bad."},{"type":"paragraph","text":"The old double down was bad, but you kinda knew what you were getting. It was just two slabs of chicken, a bit of processed cheese, and a slice of bacon. In reality those other two elements didn\u0027t make much of a dent in the flavour profile and all you really tasted was KFC chicken."},{"type":"paragraph","text":"Some elements are still ok, the chicken is fine, the cheese is still shite but edible. But god, the hash brown?"},{"type":"paragraph","text":"The addition of the hash brown messes with both the consistency and the flavour; it\u0027s now a weird mess of stodge that is honestly quite unpleasant in the mouth."},{"type":"paragraph","text":"I will admit, me aging and the diet I\u0027ve been on in prep for surgery in March has changed my response to a lot of fast food; I had a dominos pizza the other week as a treat and I simply did not like it anymore. So me disliking it may not all be on the double down, but it certainly didn\u0027t help itself."},{"type":"paragraph","text":"So yeah do not rate. I wouldn\u0027t buy it if I were you. 3/10. Alright cheers everyone see you in the next post."},{"type":"paragraph","text":"UPDATE: 01/03/2025"},{"type":"paragraph","text":"I hypothesised that the root issue of the new double down was the hash brown. And I am a woman of science, so I needed to test my hypothesis, so today I visited my local KFC and ordered another double down without the hash brown."},{"type":"paragraph","text":"I am pleased to report that my hypothesis was correct. Removing the hash brown corrected the balance of the item, cutting out the stodge and accentuating the crunch of the coating with the chicken and sauce. Much, much better. Solid fast food item, 4 stars."}]}