{"format":"particle","title":"The End of Transition","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"The End of Transition"},{"type":"paragraph","text":"19/04/2025"},{"type":"paragraph","text":"On 11/04/2025 I finally got \u0027the op.\u0027 And I feel some kinda way about it."},{"type":"paragraph","text":"This is gonna be quite a personal entry, as you might imagine. And while I wander into a lot of personal thoughts and feelings generally in my entries, this is closer than most, and the physical and mental scars are still fresh. So bear with me."},{"type":"paragraph","text":"I\u0027ve been in the gender care system in the UK for roughly a decade at this point. That\u0027s charting from first referral from my GP. It took about 5 years from that point to get seen by Notts GIC, a year to be put on hormones, and around 4 more to finally be slapped on to an operating table. Let\u0027s be clear. This is an unacceptable amount of time for a person to wait for life-saving treatment."},{"type":"paragraph","text":"And it is life-saving. I\u0027m not sure surgery specifically was for me, more on that in a bit, but the myriad dysphorias that come with being trans are huge risk factors. Getting on HRT was life-saving for me, certainly. If I hadn\u0027t had a very loving partner to help me through the early years I likely wouldn\u0027t have hit that 6 year mark when I could finally begin it \u0027officially.\u0027"},{"type":"paragraph","text":"DIYing is commonplace of course, but when I began my transition, I was alone and scared and didn\u0027t know a single other trans person who could have helped me access hormones. So the Legal Route was the only way I could do it."},{"type":"paragraph","text":"For anyone beginning transition today, all I can say is: do not wait. Break the law and biohack your body. If you live in the UK, our healthcare is only getting worse. There is still time."},{"type":"paragraph","text":"But yeah. Surgery. I\u0027ve never had major surgery before. I didn\u0027t know what to expect going in. The care I received at Nuffield Brighton was exemplary from start to finish and is a huge reason I didn\u0027t panic, but I still panicked a bit, especially after we ended up waiting for around 5 hours between check-in and actual surgery time. The anaesthetist gave me an epidural, which very nearly made me feint (bad!) but I didn\u0027t because the other anaesthetist held on to me very tightly (good!). Then I got put to sleep for 3 hours, woke up in recovery, chatted shit about chocolate bars and got wheeled back to my ward."},{"type":"paragraph","text":"I say ward. Private hospital, so it was a private room, swanky. I think that was good overall? But I did feel pretty lonely when all the various healthcare people had done their morning rounds and there was still multiple hours before Cat could come visit."},{"type":"paragraph","text":"That first evening after surgery was pretty chill by virtue of still being stoned from the epidural and the anaesthetic. The first two days after surgery sucked. I wasn\u0027t allowed to get up, so was on my back all day, which it turns out gives you horrendous trapped wind. Which also really, really hurts. Pain from my surgery was actually fairly minimal, most pain I had those first few days was wind. Bodies are so stupid."},{"type":"paragraph","text":"Then the next day I was sitting up, and walking, and showering, and I saw her for the first time. If you\u0027re a friend, you\u0027ve probably already seen the photos. If you haven\u0027t, ask me if you\u0027re curious and I\u0027ll DM you. It\u0027s a medical miracle, honestly. Hats off to my surgeon, Mr. Larner, he can really invert a penis."},{"type":"paragraph","text":"Then I was packed off home for two weeks housebound, with a further 6-8 weeks of recovery after that. And that\u0027s the lot. I\u0027m officially at the end of the gender clinic pipeline."},{"type":"paragraph","text":"And now, I feel kinda strange. So much of my life has been defined by this journey. The waiting, the phone calls, the fighting and pain and misery of battling a system designed to gatekeep as many people from transitioning as possible. I won. And my prize is to just... live my life."},{"type":"paragraph","text":"It\u0027s... weird. Discombobulating. I think I feel really adrift right now. Being cooped up in the house 24/7 doesn\u0027t help of course, but I feel purposeless. I\u0027ve been playing a lot of Blue Prince, and it honestly kinda feels like the run after reaching 46. The goal has been achieved, the crown sits atop your head. So what next?"},{"type":"paragraph","text":"Living my life is next, I guess. The popular concept of transition is largely medical, and while I have been socially transitioned for a long, long time, I\u0027m interested what doors surgery will open for me. I suddenly feel safer, for one, even despite the country I live in. If some odious terf decides to genital inspect me, then well... they\u0027re gonna be surprised."},{"type":"paragraph","text":"And while for me my dick never caused me enormous amounts of dysphoria, I\u0027m excited about what new opportunities I have now. I can wear leggings without a skirt. I can go swimming with no worries. I can have lots of weird, new and exciting sex. The world is bright and wide and I am very lucky to be able to experience a whole new side of it."},{"type":"paragraph","text":"So I\u0027m choosing not to see this as an end. This is a new beginning, and I\u0027m sat in Ube-Shinkawa Station, ready for the world. I just hope it\u0027s ready for me."},{"type":"paragraph","text":"I made an alternative image for this entry, because much like Eva this is both an ending and a beginning. I think I like the pun in this one more. Please enjoy."}]}