{"format":"particle","title":"Despite Everything, It\u0027s Still You.","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"Despite Everything, It\u0027s Still You."},{"type":"paragraph","text":"15/09/2025"},{"type":"paragraph","text":"It\u0027s 2015. December 23rd, to be exact. I\u0027m sat in front of my PC with my parents in the other room. And I\u0027m crying."},{"type":"paragraph","text":"It\u0027s 2016. Sometime in May. I\u0027m sitting on the bed with my girlfriend in her flat in Sheffield. And I\u0027m crying."},{"type":"paragraph","text":"It\u0027s 2017. I\u0027m sitting in my partner\u0027s front room. We\u0027re eating pizza. And I\u0027m crying."},{"type":"paragraph","text":"It\u0027s 2022. I\u0027m jumping up and down in the Bodega in Nottingham. Anamanaguchi are playing their last song before the encore. And I\u0027m crying."},{"type":"paragraph","text":"It\u0027s 2025. I\u0027m sat in a very hot concert hall the day before I\u0027m due to start back at work, two months after major surgery. And I\u0027m crying."},{"type":"paragraph","text":"All of these events have one thing in common: Undertale."},{"type":"paragraph","text":"Undertale came out ten years ago today. One of the last smash hit indies that would be released before the entire market fractured and changed. It is unlike anything else released that year. Or the previous year, or the next year. The only game that will come close to Undertale is its sequel/prequel/sidequel/something else Deltarune, but even that isn\u0027t quite Undertale. Undertale both stands alone and yet will also influence hundreds, if not thousands of games to be released in the next decade."},{"type":"paragraph","text":"Undertale is something of a rosetta stone for the last decade of video games. I think if you have any interest in the medium it is a must-play. If you haven\u0027t, please stop reading now, as I will be talking in less generic terms after the screenshot here."},{"type":"paragraph","text":"Ok, are they gone?"},{"type":"paragraph","text":"The common thread in those events is Undertale, yeah. But it\u0027s more specifically Hopes and Dreams. What a track, huh? I can only really think of two songs that equal it - one from Stormblood, and one from Deltarune, of course. It\u0027s a track that really captures the hype of the finale, but it\u0027s also melancholic - the main melody, of course, is His Theme. The fight itself at this point is bittersweet. You\u0027ve SAVEd your friends, you\u0027ve perservered and stayed determined. The earth refused to die. And all that\u0027s left, at the end of everything, is a crying little boy."},{"type":"paragraph","text":"I\u0027ve never replayed Undertale myself. I played it through once in 2015 and then kept the save, safe and backed up on my desktop, for years. But I have watched two partners play through it, and cried at the same points every time."},{"type":"paragraph","text":"I can\u0027t even listen to the title track without crying. That walk through New Home... there\u0027s nothing else like it."},{"type":"paragraph","text":"It\u0027s bizarre to say, maybe, but I think Toby Fox is a generational talent. One day he\u0027ll be spoken of in the same breath as people like Stephen King, David Lynch, Hideo Kojima - incredibly impressive, omni-talented indivduals with singular, totemic vision. I guess that would make Deltarune Fox\u0027s Twin Peaks, his MGS3? It\u0027s only half-finished and it\u0027s far beyond most works in the form. One can only imagine what chapter 5 and on can bring."},{"type":"paragraph","text":"But, yeah. Only played once. It feels... kinda wrong to play it again? I never did a No Mercy route either. How could I hurt all these characters I\u0027d grown to love?"},{"type":"paragraph","text":"And then Deltarune arrived. And one of its many themes is the horror of getting lost in escapism. Why do you care about these characters? Why should you? They\u0027re not real, after all. Ralsei even says it to camera."},{"type":"paragraph","text":"It\u0027s a rarity to see in games, a follow-up so in conversation with its predecessor and with its fanbase. Deltarune chapter 1 retells Undertale, asks why you care, and then, after it\u0027s broken you down, dares to ask: \u0022after all that, is it still you?\u0022 and plunges you into a new story about finding things long thought lost in the dark."},{"type":"paragraph","text":"It\u0027s magical. And it wouldn\u0027t be possible at all without Undertale; the game would not be able to deliver its gut punch in even close to the same fashion if Undertale hadn\u0027t laid all that ground work."},{"type":"paragraph","text":"Deltarune, impossibly, makes a once-in-a-generation game even better. If, for some reason, you haven\u0027t played Deltarune, this is your sign to do so. It will make Undertale even better for you."},{"type":"paragraph","text":"And if you kept reading anyway, despite my warning above: please. Play Undertale. Then play Deltarune. Then DM me so we can go insane together."},{"type":"paragraph","text":"At the end of New Home, you reach a house. And in that house, is a mirror. And you look in that mirror, at the end of your journey. And it drops a line that has reverberated through culture ever since."},{"type":"paragraph","text":"It\u0027s been a decade. But despite everything, it\u0027s still you."}]}