{"format":"particle","title":"So Your Country Is Censoring The Internet. What Now?","content":[{"type":"button","label":"Home","action":"https://athene.gay/entries/../index.json"},{"type":"paragraph","text":"So Your Country Is Censoring The Internet. What Now?"},{"type":"paragraph","text":"24/07/2025"},{"type":"paragraph","text":"The UK\u0027s online safety act sucks. Let\u0027s get around it."},{"type":"paragraph","text":"If you use one of many popular social networking sights and are a resident of the hellhole commonly referred to as \u0022The United Kingdom,\u0022 you have likely recently been asked to submit your ID for age verification. If you haven\u0027t yet, it\u0027s coming soon to whatever sites you use - Bluesky, as of this morning, are asking every UK user to get an ID check in order to use DMs or see \u0027adult\u0027 posts. Instagram and Facebook are about to roll it out too. Twitter probably won\u0027t but only because it\u0027s the nazi site. You should not be using twitter unless you\u0027re a nazi."},{"type":"paragraph","text":"If you\u0027re like me, you probably think this is Quite Bad. And it is Quite Bad! The cause of this is the \u0027Online Safety Act,\u0027 a well-intentioned but ultimately disastrous effort by the UK government to Protect The Children by preventing easy access to \u0027adult content.\u0027 Unfortunately as ever this means a lot of not adult stuff, particularly queer media and LGBT people\u0027s accounts, get caught in the dragnet. Considering the UK\u0027s current approach to queerness (they hate it, especially transgressive genderfucks like me) this may worry you. It should."},{"type":"paragraph","text":"So, maybe you want to avoid uploading your ID to a third party who can use that data how they then wish. (They all promise to delete your ID. I do not trust them to do this.) Great news! Much like all UK internet legislation, it is quite trivial to avoid this. Admittedly, it is not as easy as avoiding IP blocks on pirate websites, which was as simple as changing the DNS settings on your connection. but it\u0027s not actually that far off."},{"type":"paragraph","text":"You have probably heard of VPNs by now. Every other youtuber is advertising them. Unfortunately, they are advertising the dogshit ones that you simply should not use if you care about privacy. Surfshark, specifically, will not hesitate to hand your data over to authorities. It should ONLY be used for watching other country\u0027s netflix catalogues."},{"type":"paragraph","text":"But I digress."},{"type":"paragraph","text":"As part of my own research to get around this, I had a scan over the current crop of paid VPN services currently available. After some evaluation, my recommendation is ProtonVPN. Proton is a swiss company that specialises in privacy-focused internet applications. They started with ProtonMail (which I also use), but ProtonVPN is their next-most mature offering."},{"type":"paragraph","text":"Proton offers exit points in basically every country in the world, with quite a lot of servers in each. Speeds are solid (I have basically not noticed a drop) and ping seems serviceable for those of you who play a lot of twitch shooters. The free offering lets you connect to 5 random countries for one device, which isn\u0027t a whole lot of good - if the countries you draw don\u0027t include say, Iceland, Switzerland or the Netherlands, you\u0027re not gonna live a truly uncensored life. The free tier is also what every other prole is using, so speeds are going to be generally worse than on the paid pro version. The pro version is £8 a month which is IMO quite reasonable."},{"type":"paragraph","text":"Like many other offerrings, Proton provides its own app on all platforms that allows you to choose the country to connect via, but it also supports router-level configuration via OpenVPN and Wireguard, the two most common VPN protocols."},{"type":"paragraph","text":"\u0022What are these things?\u0022 ok yes I just said scary words. You probably don\u0027t need to worry about it - the pro tier supports 10 independent devices, so you can install the VPN on every geneal purpose computing device you have without worrying about the router level stuff."},{"type":"paragraph","text":"But I\u0027m a nerd, and the purpose of this particular post is to inform people about these things! So let\u0027s get into those scary words. OpenVPN and Wireguard are open-source VPN protocols, they are used to standardise how you connect to a VPN on any device. All the apps that VPN services provide are based on one of these two protocols. Most modern routers that are not provided by your ISP support one or both of them!"},{"type":"paragraph","text":"So yes, if you want router-level protection you will probably need to buy a new router, and realistically that\u0027s gonna be another £50 - £100. Which I grant is a significant outlay! Hence why I don\u0027t think any random person is going to want to do this unless they\u0027re a nerd like me. I already maintain a lot of my own network infrastructure, so yes, I\u0027m the freak here lol."},{"type":"paragraph","text":"But! If you do go down that route, it\u0027s worthwhile, because you can set up your network to route all traffic via your VPN, ensuring every device you use in your home is private. It\u0027s what I\u0027m doing! But like I said I\u0027m a freak so don\u0027t necessarily follow my lead on this one."},{"type":"paragraph","text":"ANYWAY. Point is it\u0027s actually kinda trivial to get this nerd shit set up nowadays! The apps services provide are simple and easy, and they\u0027re also pretty cheap! I suggest getting one now, before the continued censorship of the internet gets worse! OK thanks I\u0027m out, see ya later for a more interesting post probably."}]}